Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.SetRebarShapeFromCurves(Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.BarTerminationsData,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition)
This method will obtain a RebarShape from the input parameters and sets it into Rebar element.
First it will check if the input curves and other parameters match to an existing shape.
If matches will use it, otherwise will try to create it and will use it.
If the creation will also fail, will throw InvalidOperationException.
style:
The usage of the bar, "standard" or "stirrup/tie".
attachementType:
The attachement type - Interior or Exterior to cover.
curves:
The curves.
norm:
The normal to the plane that the rebar curves lie on.
BarTerminationsData:
The bar terminations data.
multiplanarDefinition:
The multiplanar definition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
-or-
The curves are not lying in a plane.
-or-
The norm is not perpendicular to the curves plane.
Since:
2018

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.FlipRebar
Flips the rebar by flipping the ends and the bar segments.
Remarks:
This method flips the curve loop of the rebar, changing start with end, and segment i with segment n - i - 1 (with i from 0 up to n - 1).
This method is not applicable for a spiral shaped rebar.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
-or-
This RebarShapeDrivenAccessor is an instance of a spiral shape.
Since:
2026.1

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.SetLayoutAsCustomSpacing(System.String,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to Custom Spacing.
customSpacingFormula:
The layout formula.
arrayLength:
The distribution length of rebar set. This will be used only if the formula contains percentage or it contains "?",
otherwise the array length will be calculated from the formula and will be stored in the rebar.
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
includeFirstBar:
Identifies if the first bar in rebar set is shown.
includeLastBar:
Identifies if the last bar in rebar set is shown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified formula is not valid (doesn't have a valid syntax).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This RebarShapeDrivenAccessor is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Since:
2027

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.ComputeDrivingCurves
Compute the driving curves.
Remarks:
The driving curves are the ones that appear in rebar sketch
mode. They include lines and arcs that drive the shape, but
exclude fillets, hooks and cranks. They always lie in a plane--
if the bar is 3D, these curves are a subset or a projection.
They are also used for shape matching.
Returns:
Returns an empty array if an error is encountered.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Since:
2018

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.ArrayLength
Identifies the distribution path length of rebar set.
The distribution path length of rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
-or-
When setting this property: The rebar has layout Single or it has a layout that produce a fixed length for the set.
Since:
2018